In [ ]:
# 10.1 How to Think About Group Operations

In [1]:
import numpy as np

import pandas as pd

In [2]:
In [14]: df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
   ....:                    "key2" : pd.Series([1, 2, 1, 2, 1, None, 1],
   ....:                                       dtype="Int64"),
   ....:                    "data1" : np.random.standard_normal(7),
   ....:                    "data2" : np.random.standard_normal(7)})

In [15]: df

   key1  key2     data1     data2
0     a     1  0.419801 -0.907032
1     a     2  0.186412  0.848101
2  None     1  1.049512  0.294745
3     b     2 -0.129805 -0.868928
4     b     1  0.106170  1.837369
5     a  <NA> -0.281305  1.754678
6  None     1  0.274273  0.061640

In [3]:
In [16]: grouped = df["data1"].groupby(df["key1"])

In [17]: grouped

In [4]:
In [18]: grouped.mean()

key1
a    0.108302
b   -0.011817
Name: data1, dtype: float64

In [5]:
In [19]: means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [20]: means

key1  key2
a     1       0.419801
      2       0.186412
b     1       0.106170
      2      -0.129805
Name: data1, dtype: float64

In [6]:
In [21]: means.unstack()

key2         1         2
key1
a     0.419801  0.186412
b     0.106170 -0.129805

In [8]:
In [22]: states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])

In [23]: years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]

In [24]: df["data1"].groupby([states, years]).mean()

CA  2005   -0.047447
    2006    1.049512
OH  2005    0.144998
    2006    0.190222
Name: data1, dtype: float64

In [9]:
In [25]: df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5  0.108302  0.565249
b      1.5 -0.011817  0.484220

In [10]:
In [26]: df.groupby("key2").mean(numeric_only=True)

         data1     data2
key2
1     0.462439  0.321681
2     0.028304 -0.010413

In [11]:
In [27]: df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    1     0.419801 -0.907032
     2     0.186412  0.848101
b    1     0.106170  1.837369
     2    -0.129805 -0.868928

In [12]:
In [28]: df.groupby(["key1", "key2"]).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [13]:
In [29]: df.groupby("key1", dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [14]:
In [30]: df.groupby(["key1", "key2"], dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [15]:
In [31]: df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [17]:
In [32]: for name, group in df.groupby("key1"):
   ....:     print(name)
   ....:     print(group)
   ....:

a
  key1  key2     data1     data2
0    a     1  0.419801 -0.907032
1    a     2  0.186412  0.848101
5    a  <NA> -0.281305  1.754678
b
  key1  key2     data1     data2
3    b     2 -0.129805 -0.868928
4    b     1  0.106170  1.837369

In [18]:
In [33]: for (k1, k2), group in df.groupby(["key1", "key2"]):
   ....:     print((k1, k2))
   ....:     print(group)
   ....:

('a', np.int64(1))
  key1  key2     data1     data2
0    a     1  0.419801 -0.907032
('a', np.int64(2))
  key1  key2     data1     data2
1    a     2  0.186412  0.848101
('b', np.int64(1))
  key1  key2    data1     data2
4    b     1  0.10617  1.837369
('b', np.int64(2))
  key1  key2     data1     data2
3    b     2 -0.129805 -0.868928

In [19]:
In [34]: pieces = {name: group for name, group in df.groupby("key1")}

In [35]: pieces["b"]

  key1  key2     data1     data2
3    b     2 -0.129805 -0.868928
4    b     1  0.106170  1.837369

In [20]:
In [36]: grouped = df.groupby({"key1": "key", "key2": "key",
   ....:                       "data1": "data", "data2": "data"}, axis="columns")

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_1003/3412971137.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby({"key1": "key", "key2": "key",

In [21]:
In [37]: for group_key, group_values in grouped:
   ....:     print(group_key)
   ....:     print(group_values)
   ....:

data
      data1     data2
0  0.419801 -0.907032
1  0.186412  0.848101
2  1.049512  0.294745
3 -0.129805 -0.868928
4  0.106170  1.837369
5 -0.281305  1.754678
6  0.274273  0.061640
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

In [22]:
In [38]: df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    1    -0.907032
     2     0.848101
b    1     1.837369
     2    -0.868928

In [23]:
In [39]: s_grouped = df.groupby(["key1", "key2"])["data2"]

In [40]: s_grouped

In [24]:
In [41]: s_grouped.mean()

key1  key2
a     1      -0.907032
      2       0.848101
b     1       1.837369
      2      -0.868928
Name: data2, dtype: float64

In [26]:
In [42]: people = pd.DataFrame(np.random.standard_normal((5, 5)),
   ....:                       columns=["a", "b", "c", "d", "e"],
   ....:                       index=["Joe", "Steve", "Wanda", "Jill", "Trey"])
In [43]: people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [44]: people

              a         b         c         d         e
Joe    0.167744  0.782891  0.007502  0.686940  1.148831
Steve  0.104384  0.822713 -1.566105 -0.370058  0.160322
Wanda  0.241287       NaN       NaN  0.658663 -0.312956
Jill  -0.476222  0.945200 -1.592069  0.202319  0.745670
Trey   0.133816  2.177690 -0.763261  1.390724  2.098816

In [27]:
In [45]: mapping = {"a": "red", "b": "red", "c": "blue",
   ....:            "d": "blue", "e": "red", "f" : "orange"}

In [28]:
In [46]: by_column = people.groupby(mapping, axis="columns")

In [47]: by_column.sum()

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_1003/1795800171.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis="columns")

           blue       red
Joe    0.694442  2.099466
Steve -1.936163  1.087418
Wanda  0.658663 -0.071669
Jill  -1.389750  1.214648
Trey   0.627463  4.410322

In [29]:
In [48]: map_series = pd.Series(mapping)

In [49]: map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [30]:
In [50]: people.groupby(map_series, axis="columns").count()

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_1003/1047363242.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis="columns").count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

In [31]:
In [51]: people.groupby(len).sum()

          a         b         c         d         e
3  0.167744  0.782891  0.007502  0.686940  1.148831
4 -0.342407  3.122890 -2.355330  1.593043  2.844486
5  0.345670  0.822713 -1.566105  0.288605 -0.152634

In [32]:
In [52]: key_list = ["one", "one", "one", "two", "two"]

In [53]: people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.167744  0.782891  0.007502  0.686940  1.148831
4 two -0.476222  0.945200 -1.592069  0.202319  0.745670
5 one  0.104384  0.822713 -1.566105 -0.370058 -0.312956

In [34]:
In [54]: columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
   ....:                                     [1, 3, 5, 1, 3]],
   ....:                                     names=["cty", "tenor"])

In [55]: hier_df = pd.DataFrame(np.random.standard_normal((4, 5)), columns=
                                columns)

In [56]: hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.115734  1.104330  1.397921  0.025993  0.539861
1     -0.611179  0.369238 -0.505518  1.098723 -1.491110
2      1.862603 -0.225447 -1.037304  0.379738 -1.252850
3     -0.251979  1.146484  1.562545  0.487763  1.030179

In [35]:
In [57]: hier_df.groupby(level="cty", axis="columns").count()

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_1003/1557373178.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="cty", axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [ ]:
# 10.2 Data Aggregation

In [36]:
In [58]: df

   key1  key2     data1     data2
0     a     1  0.419801 -0.907032
1     a     2  0.186412  0.848101
2  None     1  1.049512  0.294745
3     b     2 -0.129805 -0.868928
4     b     1  0.106170  1.837369
5     a  <NA> -0.281305  1.754678
6  None     1  0.274273  0.061640

In [37]:
In [59]: grouped = df.groupby("key1")

In [60]: grouped["data1"].nsmallest(2)

key1
a     5   -0.281305
      1    0.186412
b     3   -0.129805
      4    0.106170
Name: data1, dtype: float64

In [38]:
In [61]: def peak_to_peak(arr):
   ....:     return arr.max() - arr.min()

In [62]: grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  0.701106  2.661710
b        1  0.235975  2.706296

In [39]:
In [63]: grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0  0.108302  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0 -0.011817  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a     0.303106  0.419801   3.0  0.565249  1.353211 -0.907032 -0.029465
b     0.047177  0.106170   2.0  0.484220  1.913640 -0.868928 -0.192354


           50%       75%       max
key1
a     0.848101  1.301390  1.754678
b     0.484220  1.160794  1.837369

[2 rows x 24 columns]

In [40]:
In [64]: tips = pd.read_csv("examples/tips.csv")

In [65]: tips.head()

FileNotFoundError: [Errno 2] No such file or directory: 'examples/tips.csv'

In [ ]:
In [66]: tips["tip_pct"] = tips["tip"] / tips["total_bill"]

In [67]: tips.head()

In [ ]:
In [68]: grouped = tips.groupby(["day", "smoker"])

In [ ]:
In [69]: grouped_pct = grouped["tip_pct"]

In [70]: grouped_pct.agg("mean")